renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/serial_terminal_task.c
/******************************************************************************
 External variables
 ******************************************************************************/

/******************************************************************************
 Private global variables
 ******************************************************************************/
static void display_serial_terminal_putstring_with_uart(WM_HWIN hWin_handle, sci_hdl_t sci_handle, char *string);
static void sci_callback(void *pArgs);
static void execute_command(uint8_t *command_line);
static int32_t get_command_code(uint8_t *command);

static sci_hdl_t sci_handle;
static QueueHandle_t xQueue;
static SemaphoreHandle_t xSemaphore;
static char *message_buffer;
static uint32_t _10us_timer_count;

/******************************************************************************
 External functions
 ******************************************************************************/
extern void display_serial_terminal_putstring(WM_HWIN hWin_handle, char *string);

extern void vTaskGetCombinedRunTimeStats( char* pcWriteBuffer,  UBaseType_t uxClear);
extern void vTaskClearUsage(void);
extern void vTaskClearUsageSingleList(List_t *pxList);

extern void firmware_version_read(char **ver_str);
extern void software_reset(void);

/*******************************************************************************
 global variables and functions
********************************************************************************/
void serial_terminal_task( void * pvParameters );
void _10us_timer_tick(void *arg);
void vConfigureTimerForRunTimeStats(void);
uint32_t ulGetRunTimeCounterValue(void);

/******************************************************************************
 Function Name   : serial_terminal_task
 Description     : serial_terminal_task
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void serial_terminal_task( void * pvParameters )
{
	TASK_INFO *task_info = (TASK_INFO *)pvParameters;

    sci_cfg_t   sci_config;
    char tmp[2];
    char *ver;
    tmp[1] = 0;
    char *sci_buffer;
    uint32_t current_buffer_pointer = 0;
    uint8_t *command, *arg1, *arg2, *arg3, *arg4;

    static const char timezone_label[] = "timezone";
    static const char client_private_key_label[] = "client_private_key";
    static const char client_certificate_label[] = "client_certificate";
    static const char iot_thing_name_label[] = "iot_thing_name";
    static const char mqtt_broker_endpoint_label[] = "mqtt_broker_endpoint";
	static const char code_signer_certificate_label[] = "code_signer_certificate";

	SFD_HANDLE sfd_handle_timezone, sfd_handle_tmp;
	uint8_t *timezone;
	uint32_t timezone_length;

    uint8_t *label, *data;
    uint32_t label_length, data_length;

    /* wait completing gui initializing */
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

    sci_buffer = pvPortMalloc(SCI_BUFFER_SIZE);
    command = pvPortMalloc(COMMAND_SIZE);
    arg1 = pvPortMalloc(ARGUMENT1_SIZE);
    arg2 = pvPortMalloc(ARGUMENT2_SIZE);
    arg3 = pvPortMalloc(ARGUMENT3_SIZE);
    arg4 = pvPortMalloc(ARGUMENT4_SIZE);
    message_buffer = pvPortMalloc(MESSAGE_BUFFER_SIZE);

    memset(sci_buffer, 0, SCI_BUFFER_SIZE);
    memset(command, 0, COMMAND_SIZE);
    memset(arg1, 0, ARGUMENT1_SIZE);
    memset(arg2, 0, ARGUMENT2_SIZE);
    memset(arg3, 0, ARGUMENT3_SIZE);
    memset(arg4, 0, ARGUMENT4_SIZE);
    memset(message_buffer, 0, MESSAGE_BUFFER_SIZE);

    R_SCI_PinSet_serial_term();

    /* Set up the configuration data structure for asynchronous (UART) operation. */
    sci_config.async.baud_rate    = MY_BSP_CFG_SERIAL_TERM_SCI_BITRATE;
    sci_config.async.clk_src      = SCI_CLK_INT;
    sci_config.async.data_size    = SCI_DATA_8BIT;
    sci_config.async.parity_en    = SCI_PARITY_OFF;
    sci_config.async.parity_type  = SCI_EVEN_PARITY;
    sci_config.async.stop_bits    = SCI_STOPBITS_1;
    sci_config.async.int_priority = MY_BSP_CFG_SERIAL_TERM_SCI_INTERRUPT_PRIORITY;    // 1=lowest, 15=highest
    R_SCI_Open(SCI_CH_serial_term, SCI_MODE_ASYNC, &sci_config, sci_callback, &sci_handle);

    /* create queue */
	xQueue = xQueueCreate(SERIAL_BUFFER_QUEUE_NUMBER, SERIAL_BUFFER_SIZE);

    /* create semaphore */
	xSemaphore = xSemaphoreCreateBinary();

	display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, PROMPT);
	while(1)
	{
		xQueueReceive(xQueue, &tmp, portMAX_DELAY);
		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, tmp);
		sci_buffer[current_buffer_pointer++] = tmp[0];
		if((tmp[0] == 0x0a) && (sci_buffer[current_buffer_pointer - 2] == 0x0d))
		{
		    /* command execution */
		    if ( 0 != sscanf((char*)sci_buffer, "%16s %256s %256s %4096s %4096s", command, arg1, arg2, arg3, arg4))
		    {
		        switch(get_command_code(command))
		        {
		        	case COMMAND_FREERTOS:
		        		if(!strcmp((const char *)arg1, "cpuload"))
		        		{
		        			if(!strcmp((const char *)arg2, "read"))
		        			{
		        				vTaskGetCombinedRunTimeStats(message_buffer, 0);	/* 0 means read */
				        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        			}
		        			if(!strcmp((const char *)arg2, "reset"))
		        			{
		        				vTaskGetCombinedRunTimeStats(message_buffer, 1);	/* 1 means read->reset */
		        				vTaskGetCombinedRunTimeStats(message_buffer, 0);	/* 0 means read */
				        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        			}
		        		}
		        		break;
		        	case COMMAND_VERSION:
		        		firmware_version_read(&ver);
		        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, ver);
		        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, "\r\n");
		        		break;
		        	case COMMAND_TIMEZONE:
	        			R_SFD_Open();
		        		sfd_handle_timezone = R_SFD_SaveObject((uint8_t *)timezone_label, strlen(timezone_label), arg1, strlen((char *)arg1) + 1); /* +1 means string terminator '\0' */
		        		R_SFD_GetObjectValue(sfd_handle_timezone, (uint8_t **)&timezone, &timezone_length);
			            if(SYS_TIME_SUCCESS == R_SYS_TIME_ConvertUnixTimeToSystemTime(task_info->sys_time.unix_time, &task_info->sys_time, timezone))
			            {
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, "timezone is accepted.\r\n");
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, "system time is updated.\r\n");
			            }
			            else
			            {
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, "timezone is not accepted.\r\n");
			            }
	        			R_SFD_Close();
		        		break;
		        	case COMMAND_RESET:
		        		software_reset();
		        		break;
		        	case COMMAND_DATAFLASH:
		        		if(!strcmp((const char *)arg1, "info"))
		        		{
		        			R_SFD_Open();
		        			sprintf(message_buffer, "physical size = %d bytes.\n", R_SFD_ReadPysicalSize());
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        			sprintf(message_buffer, "allocated size = %d bytes.\n", R_SFD_ReadAllocatedStorageSize());
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        			sprintf(message_buffer, "free size = %d bytes.\n", R_SFD_ReadFreeSize());
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        			R_SFD_Close();
		        		}
		        		else if(!strcmp((const char *)arg1, "write"))
		        		{
			        		if(!strcmp((const char *)arg2, "aws"))
			        		{
				        		if((!strcmp((const char *)arg3, "clientprivatekey")) || (!strcmp((const char *)arg3, "clientcertificate"))  || (!strcmp((const char *)arg3, "codesignercertificate")))
				        		{
				        			current_buffer_pointer = 0;
								    memset(sci_buffer, 0, SCI_BUFFER_SIZE);
				        			while(1)
				        			{
										xQueueReceive(xQueue, &tmp, portMAX_DELAY);
										display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, tmp);
										sci_buffer[current_buffer_pointer++] = tmp[0];
										if((strstr(sci_buffer, "-----END RSA PRIVATE KEY-----\n")) || (strstr(sci_buffer, "-----END CERTIFICATE-----\n")))
										{
											char *target;
											if((!strcmp((const char *)arg3, "clientprivatekey")) && strstr(sci_buffer, "-----END RSA PRIVATE KEY-----\n"))
											{
												target = (char *)client_private_key_label;
											}
											else if((!strcmp((const char *)arg3, "clientcertificate")) && strstr(sci_buffer, "-----END CERTIFICATE-----\n"))
											{
												target = (char *)client_certificate_label;
											}
											else if((!strcmp((const char *)arg3, "codesignercertificate")) && strstr(sci_buffer, "-----END CERTIFICATE-----\n"))
											{
												target = (char *)code_signer_certificate_label;
											}
											else
											{
							        			sprintf(message_buffer, "could not store data into dataflash.\n");
								        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
												break;
											}

						        			R_SFD_Open();
						        			sci_buffer[current_buffer_pointer] = 0;
						        			/* +1 means '\0' as a string terminator */
						        			if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)target, strlen(target), (uint8_t *)sci_buffer, strlen((const char *)sci_buffer) + 1))
						        			{
							        			sprintf(message_buffer, "stored data into dataflash correctly.\n");
								        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
						        			}
						        			else
						        			{
							        			sprintf(message_buffer, "could not store data into dataflash.\n");
								        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
						        			}
						        			R_SFD_Close();
											break;
										}
										if((strstr(sci_buffer, "quit")) || (strstr(sci_buffer, "exit")))
										{
											break;
										}
										if(current_buffer_pointer == SCI_BUFFER_SIZE)
										{
										    memset(sci_buffer, 0, SCI_BUFFER_SIZE);
										    current_buffer_pointer = 0;
										}
				        			}
				        		}
				        		else if((!strcmp((const char *)arg3, "mqttbrokerendpoint")))
				        		{
				        			R_SFD_Open();
				        			/* +1 means '\0' as a string terminator */
				        			if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)mqtt_broker_endpoint_label, strlen(mqtt_broker_endpoint_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
				        			{
					        			sprintf(message_buffer, "stored data into dataflash correctly.\n");
						        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			}
				        			else
				        			{
					        			sprintf(message_buffer, "could not store data into dataflash.\n");
						        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			}
				        			R_SFD_Close();
				        		}
				        		else if((!strcmp((const char *)arg3, "iotthingname")))
				        		{
				        			R_SFD_Open();
				        			/* +1 means '\0' as a string terminator */
				        			if(SFD_HANDLE_INVALID != R_SFD_SaveObject((uint8_t *)iot_thing_name_label, strlen(iot_thing_name_label), (uint8_t *)arg4, strlen((const char *)arg4) + 1))
				        			{
					        			sprintf(message_buffer, "stored data into dataflash correctly.\n");
						        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			}
				        			else
				        			{
					        			sprintf(message_buffer, "could not store data into dataflash.\n");
						        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			}
				        			R_SFD_Close();
				        		}
				        		else
				        		{
				        			sprintf(message_buffer, "unknown argument3 = %s.\n", arg3);
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        		}
			        		}
			        		else
			        		{
			        			sprintf(message_buffer, "unknown argument2 = %s.\n", arg2);
				        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
			        		}
		        		}
		        		else if(!strcmp((const char *)arg1, "read"))
		        		{
	        				R_SFD_ResetScan();
		        			while(1)
		        			{
		        				if(SFD_SUCCESS == R_SFD_Scan(&label, &label_length, &data, &data_length))
		        				{
				        			sprintf(message_buffer, "label = ");
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			memcpy(message_buffer, label, label_length);
				        			message_buffer[label_length] = 0;
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			sprintf(message_buffer, "\n");
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			sprintf(message_buffer, "data = ");
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			memcpy(message_buffer, data, data_length);
				        			message_buffer[data_length] = 0;
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
					        		vTaskDelay(100); /* 長い文字列をSCI(UART)出力した際に最後のほうが出力されない。完了待ちの方法が不明なためとりあえず時間待ち */
				        			sprintf(message_buffer, "\n");
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			sprintf(message_buffer, "data_length(includes string terminator 1byte zero) = %d", data_length);
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
				        			sprintf(message_buffer, "\n\n");
					        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        				}
		        				else
		        				{
		        					break;
		        				}
		        			}
		        		}
		        		else if(!strcmp((const char *)arg1, "erase"))
		        		{
		        			R_SFD_EraseAll();
		        			sprintf(message_buffer, "completed erasing all flash.\n");
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        		}
		        		else
		        		{
		        			sprintf(message_buffer, "unknown argument1 = %s.\n", arg1);
			        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, message_buffer);
		        		}
		        		break;
		        	default:
		        		display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, COMMAND_NOT_FOUND);
		        		break;
		        }
				display_serial_terminal_putstring_with_uart(task_info->hWin_serial_terminal, sci_handle, PROMPT);
		    }
		    else
		    {

